import Link from 'next/link';
import { ReactNode } from 'react';

export type Privacy = {
    title: string;
    description: string | ReactNode;
    list?: string[];
};

export const privacy: Privacy[] = [
    {
        title: 'การเก็บรวบรวมข้อมูล',
        description:
            'เรารวบรวมและจัดเก็บข้อมูลที่จำเป็นสำหรับการจัดการกิลด์ของเราและการให้บริการของเรา ซึ่งอาจรวมถึงข้อมูลบัญชีผู้ใช้ Discord กิจกรรมการเล่นเกม และบันทึกการสื่อสาร',
        list: [
            'รหัสผู้ใช้และกิจกรรมการเล่นเกม',
            'บันทึกการสื่อสารจาก Discord และแพลตฟอร์มอื่นๆ',
            'สถิติการใช้งานที่ไม่เปิดเผยตัวตนสำหรับการปรับปรุงบริการของเรา',
        ],
    },
    {
        title: 'การใช้ข้อมูล',
        description:
            'ข้อมูลที่เรารวบรวมจะถูกใช้เพื่อจัดการกิจกรรมกิลด์และปรับปรุงประสบการณ์ผู้ใช้เท่านั้น เราไม่ขายหรือแบ่งปันข้อมูลนี้กับบุคคลที่สาม',
        list: [
            'จัดการกิจกรรมของกิลด์',
            'การปรับปรุงประสบการณ์ผู้ใช้บนแพลตฟอร์มของเรา',
            'การสื่อสารกับสมาชิกเกี่ยวกับเรื่องที่เกี่ยวข้องกับกิลด์',
        ],
    },
    {
        title: 'ความปลอดภัยของข้อมูล',
        description:
            'เราใช้มาตรการรักษาความปลอดภัยมาตรฐานอุตสาหกรรมเพื่อปกป้องข้อมูลของคุณจากการเข้าถึง การเปลี่ยนแปลง หรือการเปิดเผยโดยไม่ได้รับอนุญาต',
        list: [
            'การเข้ารหัสข้อมูลที่ละเอียดอ่อนระหว่างการส่งข้อมูล',
            'การตรวจสอบและอัปเดตความปลอดภัยเป็นประจำ',
            'จำกัดการเข้าถึงข้อมูลโดยบุคลากรที่ได้รับอนุญาตเท่านั้น',
        ],
    },
    {
        title: 'ติดต่อเรา',
        description: (
            <>
                หากมีคำถามหรือข้อกังวลเกี่ยวกับความเป็นส่วนตัวหรือการใช้ข้อมูลของคุณ โปรดติดต่อเราที่{' '}
                <Link href="pyyupsk@proton.me" target="_blank" rel="noopener noreferrer" className="link">
                    pyyupsk@proton.me
                </Link>
                .
            </>
        ),
    },
];
