import Link from 'next/link';
import { ReactNode } from 'react';

export type Term = {
    title: string;
    description: string | ReactNode;
    list?: string[];
};

export const terms: Term[] = [
    {
        title: 'สมาชิกภาพ',
        description:
            'การเข้าร่วม Juniper Nexus แสดงว่าคุณตกลงที่จะปฏิบัติตามหลักเกณฑ์ของชุมชนของเรา และมีส่วนร่วมด้วยความเคารพและครอบคลุม',
        list: [
            'การแสดงความเคารพต่อสมาชิกท่านอื่น',
            'การปฏิบัติตามกฎกิลด์และนโยบายของเกม',
            'การมีส่วนร่วมอย่างแข็งขันในกิจกรรมของกิลด์',
        ],
    },
    {
        title: 'จัดการ',
        description:
            'สมาชิกของ Juniper Nexus ได้รับการคาดหวังให้รักษามาตรฐานระดับสูงในการดำเนินการทั้งภายในกิลด์และในการสื่อสารภายนอกที่เกี่ยวข้องกับกิลด์',
        list: [
            'การสื่อสารด้วยความเคารพและสร้างสรรค์',
            'หลีกเลี่ยงภาษาหรือพฤติกรรมที่ไม่เหมาะสม',
            'การปฏิบัติตามมาตรฐานการเล่นเกมที่ยุติธรรม',
        ],
    },
    {
        title: 'ทรัพย์สินทางปัญญา',
        description:
            'เนื้อหาทั้งหมดที่แบ่งปันภายใน Juniper Nexus รวมถึงแต่ไม่จำกัดเพียงข้อความ รูปภาพ และโค้ด ยังคงเป็นทรัพย์สินของเจ้าของที่เกี่ยวข้อง ห้ามใช้หรือแจกจ่ายโดยไม่ได้รับอนุญาต',
    },
    {
        title: 'การสิ้นสุด',
        description:
            'Juniper Nexus ขอสงวนสิทธิ์ในการยกเลิกการเป็นสมาชิกหรือการเข้าถึงทรัพยากรของกิลด์ในกรณีที่มีการประพฤติมิชอบอย่างร้ายแรงหรือละเมิดข้อกำหนดของเรา',
    },
    {
        title: 'ติดต่อเรา',
        description: (
            <>
                หากมีคำถามหรือคำชี้แจงเกี่ยวกับข้อกำหนดในการให้บริการของเรา โปรดติดต่อเราที่{' '}
                <Link href="pyyupsk@proton.me" target="_blank" rel="noopener noreferrer" className="link">
                    pyyupsk@proton.me
                </Link>
                .
            </>
        ),
    },
];
